# [R] tidy data

In [3]:
library('tidyverse')

## pivot

In [14]:
table4a %>%
pivot_longer(c('1999', '2000'), names_to = "year", values_to = "cases")

  country     year cases
1 Afghanistan 1999    745
2 Afghanistan 2000   2666
3 Brazil      1999  37737
4 Brazil      2000  80488
5 China       1999 212258
6 China       2000 213766

In [16]:
table4a %>%
pivot_longer(c('1999','2000'), names_to = 'year', values_to = 'population')

  country     year population
1 Afghanistan 1999    745
2 Afghanistan 2000   2666
3 Brazil      1999  37737
4 Brazil      2000  80488
5 China       1999 212258
6 China       2000 213766

In [17]:
table4a

  country     1999   2000
1 Afghanistan    745   2666
2 Brazil       37737  80488
3 China       212258 213766

In [25]:
tidy4a <- table4a %>%
pivot_longer(c('1999', '2000'), names_to = 'year', values_to = 'cases')
tidy4b <- table4b %>%
pivot_longer(c('1999', '2000'), names_to = 'year', values_to = 'population')
left_join(tidy4a, tidy4b)

Joining, by = c("country", "year")

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583